'''
Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. В последующих 
строках записаны N целых чисел Ai. Последняя строка содержит число X
n = 5
1 2 3 4 5
x = 3
-> 1
'''
N = int(input('Введите кол-во элементов массива: '))
list_1 = []
count = 0
for i in range(N):
    Ai = int(input())
    list_1.append(Ai)
X = int(input('Введите число которое необходимо проверить: '))
for i in range(N):
    if list_1[i] == X:
        count += 1
print(F'Число {X} встречается {count} раз')        
