'''
Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. В последующих 
строках записаны N целых чисел Ai. Последняя строка содержит число X
n = 5
1 2 3 4 5
x = 6
-> 5
'''
N = int(input('Введите кол-во элементов массива: '))
list_1 = []
count = 0
mal = 999
for i in range(N):
    Ai = int(input())
    list_1.append(Ai)
X = int(input('Введите число: '))
for i in range(N):
    if abs(list_1[i] - X) < mal:
        count = list_1[i]
print(F'Самый близкий элемент к числу {X} это: {count}')        


